    subroutine main(aw, h1, h2, t, e1, e2, e3, dL, dC)
!   VIP CL(Vertically Installed Planar Coupled Lines) 
!   Связанные линии с вертикальной вставкой (СЛ ВВ) и лицевой связью (ЛС)
    implicit complex*16(c,w,z), real*8(a-b,d-h,o-v,x-y)
    dimension z(12),w(12),betam(12),qwork(170)		! nptsq*(2n+3)=6*(2*12+3)=162 
    dimension z1(12),z2(12),z3(12), x2(12),x3(12)
    dimension aC0(4), em(2), Um(4), aC(4)
    dimension dL(4),dC(4),bC(4)			    ! Массивы dC и bC  д.б.согласованы (4)
    dimension z3c(9), z4c(9), zz4c(9), betam9(9), qwork9(150)  ! nq*(2n+3)=6*(2*9+3) =126 
    dimension z3p(10),z4p(10),zz4p(10),betam10(10),qwork10(150)! nq*(2n+3)=6*(2*10+3)=138
    
! Задание оператора-функции dCf. Вычисление емкости наклон.-совмещ. диэл. области
    dCf(e1,e2,a,b)=(a/b)*(e1*e2/(e2-e1))*log(e2/e1) ! Емк.прямоуг.конд.с диагон.границ.раздел.диэл.

!--------------------------------------------------------------------------------------
    zinf = (1.d20,1.d20)      ! "машинная" бесконечность
    zero = (0.d0, 0.d0)		  ! нуль
    zr = (1.d0, 0.d0)		  ! вещест.единица  
    zi = (0.d0, 1.d0)		  ! мнимая единица	
    pi = dacos(-1.d0)		  ! число пи
!--------------------------------------------------------------------------------------
!	Исходные данные:
    ip = -2	   ! Индекс печати = -2,-1,0,1. Если ip=0, то всё печатаем.
    n  = 2  ! количество линий
!==============================================================================
    nn = 12		! Общее кол-во вершин в исх. многоугол.(вкл. нуль и беcконеч.)
    iguess = 1
    hs = h1/2.	! Полутолщина вертикальной вставки-подложки полуструктуры (горизон.)
    hst=hs+t;
    zh2=zi*h2;  zh2w2=(h2+aw/2.)*zi;  zh2w=(h2+aw)*zi;  ! коорд. по вертикали
!------------------------------------------------------------------------------
! Координаты вершин и углы при вершинах 12-угол.исход.области полуструктуры z1
    z1(1) =      zh2w2;	betam(1) = 0.5
    z1(2) = hs + zh2w2;	betam(2) = 0.5
    z1(3) = hs + zh2w;	betam(3) = 1.5
    z1(4) = hst+ zh2w;	betam(4) = 1.5
    z1(5) = hst+ zh2;		betam(5) = 1.5
    z1(6) = hs + zh2;		betam(6) = 1.5
    z1(7) = hs + zh2w2;	betam(7) = 0.5
    z1(8) =      zh2w2;	betam(8) = 0.5
    z1(9) =	zh2;	betam(9) = 1.0 ! # 	
    z1(10)=	zero;		betam(10)= 0.5
    z1(11)= zinf;		betam(11)=-0.5
    z1(12)=		 zh2w;	betam(12)= 1.0 ! #
				betam = betam - 1. 

!==============================================================================
! Задание конформ. центра (z10 = WC) в исх. многоугол. z1
    z10 = dcmplx((hs+t)*8, (h2+aw/2)*1.3)           ! Найдено эвристич./эмпирич.

! Вычисляем узлы и веса для параметрической задачи (влияет на точность):
    nq = 6					! обычно nptsq = 2..6 
    call qinit(nn,betam,nq,qwork)
! Начальное приближение отображения на круг z2
    do k = 1,nn 
    z2(k) = exp(dcmplx(0.d0, k-nn))   
    end do
 
    tol = 1.d-6				! Точность tol = eps = 10.**(-(nq+1))
    ip=-2					! Индекс печати = -2,-1,0,1
    iguess=1				
    call scsolv(ip,iguess,tol,errest,nn, c, z2, z10, z1, betam,nq,qwork)


!! Расчет VIP-структуры СЛ сразу в воздухе
    call cap4((/2,7,10,11/),z2, aCe)  ! Емк. при четном возбужд. - е 
    call cap4((/2,7,8,1/),z2, aCo)	  ! Емк. при нечетном возбужд.- о

    aC(1) = (aCo + aCe)/2;	aC(4)=aC(1); 
    aC(2) =-(aCo - aCe)/2;  aC(3)=aC(2);  dC=aC;
! Результирующая матрица индуктивностей (мкГн/м)
    call induc(aC,dL,n)
    if(e1==e2) then 
    dC = 8.854*dC 
    return 
    endif
    betam9=(/-.5,0.,0.,0.,-.5,0.,-.5,-.5,0./)  ! Задан. углов вершин. в ЧЕТ.прямоугольнике z4c	
! Отображение диска z2 на диск z3с (перенум. точек). Поиск нужных вершин прямоугольника z4с
    z3c = (/z2(2),z2(3),z2(5),z2(6),z2(7),z2(9),z2(10),z2(11),z2(12)/) 
    call qinit(9,betam9,nq,qwork9)! Инициализация раб.массивов: betam9,nq,qwork9
    c4 = (1.,0.)				   		
    do k=1,9
    z4c(k)=WSC(z3c(k),k, zero,zero,0, 9, c4, z3c, betam9, nq, qwork9) ! Вычисл.тчк полигона z4c
    enddo
    do k=1,9
    zz4c(k)=(z4c(k) - z4c(5))/(z4c(7) - z4c(5))  ! Линейное преобраз.-нормировка zz4c	
    enddo
    xc1=real(zz4c(6));  !	print*,xc1
    yc1=imag(zz4c(4)); 	!	print*,yc1
    yc2=imag(zz4c(3));  !	print*,yc2
    yc3=imag(zz4c(1));  !	print*,yc3
    aCc11 =e2 * yc1/xc1;     if(e1/=e2) then; aCc11 = dCf(e1,e2,yc1,xc1); endif; ! print*,aCc11
    aCc12 =e2 * yc1/(1.-xc1);				!	print*,aCc12
    aCc1 = 1./(1./aCc11 + 1./aCc12);		!	print*,aCc1
    aCc2 = e2 * (yc2 -yc1);					!	print*,aCc2
    aCc3 = e2 * (yc3 - yc2);     if(e2/=e3) then; aCc3 = dCf(e2,e3,yc3-yc2,1.); endif; ! print*,aCc3
    aCc = aCc1 + aCc2 + aCc3;		
! Отображ. исход.области z1 --> диск z2 --> нечет.диск z3р --> прямоугольник z4р
	 betam10=(/-.5,0.,0.,0.,-.5,-.5,0.,0.,0.,-.5/)  ! Задан. углов вершин. в НЕЧЕТ.прямоугольнике z4p	
! Отображение диска z2 на диск z3p(перенум.точек). Поиск нужных вершин прямоугольника z4p
	 z3p = (/z2(2),z2(3),z2(5),z2(6),z2(7),z2(8),z2(9),z2(11),z2(12),z2(1)/) 
	 call qinit(10,betam10,nq,qwork10)! Инициализация раб.массивов: betam10,nq,qwork10
		c4 = (1.,0.)
	 do k=1,10
	    z4p(k)=WSC(z3p(k),k, zero,zero,0, 10, c4, z3p, betam10, nq, qwork10)! Вычисл.тчк полигона z4p
	 enddo
	    print*
	 do k=1,10
		zz4p(k)=(z4p(k) - z4p(5))/(z4p(6) - z4p(5))  ! Линейное преобраз.-нормировка zz4p

	 enddo
	yp1=imag(zz4p(7));  !	print*,yp1
	yp2=imag(zz4p(4));  !	print*,yp2
	yp3=imag(zz4p(3));  !	print*,yp3
	yp4=imag(zz4p(8));  !	print*,yp4
	yp5=imag(zz4p(2));  !	print*,yp5
	yp6=imag(zz4p(9));  !	print*,yp6
	yp7=imag(zz4p(1));  !	print*,yp7
	print*
	aCp1 = e1 * yp1;			!	print*,aCp1
	aCp2 = e1 * (yp2-yp1);	 if(e1/=e2) then; aCp2 = dCf(e1,e2,yp2 - yp1,1.); endif; ! print*,aCp2
	aCp3 = e2 * (yp3 - yp2);	!	print*,aCp3
	aCp4 = e2 * (yp4 - yp3); if(e2/=e3) then; aCp4 = dCf(e3,e2,yp4 - yp3,1.); endif; ! print*,aCp4
	aCp5 = e3 * (yp5 - yp4);	!	print*,aCp5
	aCp6 = e3 * (yp6 - yp5); if(e1/=e3) then; aCp4 = dCf(e1,e3,yp6 - yp5,1.); endif; ! print*,aCp6
	aCp7 = e1 * (yp7 - yp6);	!	print*,aCp7
	aCp = aCp1 + aCp2 + aCp3 +aCp4 + aCp5 + aCp6 + aCp7;		
!	print*,' Coo = ',aCp
!------------------------------------------------------------------------------	
! Матрица нормир.емкостей с учетом диэл. заполнения е1 и е2
		dC(1) = (aCp + aCc)/2.;
		dC(2) =-(aCp - aCc)/2.
		dC(3) = dC(2)
		dC(4) = dC(1)
! Матрица погонных емкостей полной структуры. Размерность (pF/m)			
		dC = 8.854 * dC	
!==========================================================================
	return
	end 